# 1. Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа.
# Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

list_var = [8, 'fds', 5.2, True]

print(f"1 ({list_var[0]}) - {type(list_var[0])}, 2 ({list_var[1]}) - {type(list_var[1])}, "
      f"3 ({list_var[2]}) - {type(list_var[2])}, 4 ({list_var[3]}) - {type(list_var[3])}")
